content-org/all-post.org
#+hugo_base_dir: ../

* 元宇宙辦公有搞頭嗎？ VR 虛擬桌面軟體比較                        :quest2:vr:
:PROPERTIES:
:EXPORT_FILE_NAME: vr-workspace-comparison
:EXPORT_DATE: <2023-02-18>
:END:

接觸 VR 一段時間後，以為最常用的軟體應該都是遊戲類。結果竟然都是虛擬辦公軟體。這邊就以自己嘗試軟體的經驗分享一下體驗心得。

這邊體驗的部分是以 quest2 + macOS 為主，環境是 wifi 5Ghz 頻段。

** Meta Horizon Workrooms

這款主要是 meta 推出的虛擬會議室軟體，不過近期也加入了個人辦公室的功能。
螢幕最多可以支援三個，螢幕大小跟解析度都不能調整，而且必須要有設定桌面才能使用。以使用上來說並不會覺得很難使用，螢幕文字上來說看起來也還可以。
以優點上來說，雖然目前支援的場景不多，但是完整度高的，風格也符合 meta 元宇宙，而且也整合虛擬人物的程度比較高。跟其他軟體比起來更有元宇宙的感覺。畢竟是 meta 本家的產品。

** Immersed VR

以純辦公角度來看這是是目前支援最齊全的，原本要付月費，不過近期也改成免費了。付費的部分也從原本訂閱制改為買斷制。
基本免費就有三個螢幕可以用，付費之後最多可以開到五個，螢幕大小解析度跟位置也能自行調整。如果 wifi 不是很穩定還支援 wifi direct 讓延遲降到最低。不過以 macos 來說要使用 wifi direct 只能透過 mac 分享網路給 quest 2 使用。
Immersed VR 另外的特色就是公共的辦公空間，有機會的話可能會遇到其他人，不過自己本身並沒有遇到人就是了。
空間場景雖然數量多，但品質普普。跟其他軟體比起來真的是為生產力打造。

** Virtual Desktop

這款比較偏遊戲向。不過既然也支援的螢幕投射功能就來嘗試看看。
螢幕只支援一個，而且是強烈建議使用至少電腦要用有線網路。自己使用無線網路的部分延遲跟其他軟體比起來算高，而且算已經是影響體驗的程度。
以場景來說品質是最高的，同時支援像 Immersed VR 的漂浮螢幕跟 Workrooms 的固定螢幕。以娛樂角度來說還支援像是電影院等等的場景。想起以前看到有人跑去電影院用電影院投影遊戲。現在透過 VR 就能有一樣的體驗。

** 結論

基本上 Workrooms 跟 Immersed VR 都免費，所以都可以嘗試看看，在挑選自己喜歡的。至於 Virtual Desktop 就比較偏娛樂，如果只有無線網路可能就沒有這麼推薦，畢竟是付費軟體。

** 心得

元宇宙辦公這件事情在網路上往往都是兩極評價，個人比較偏向如果把眼鏡調教好就不至於太糟糕，會體驗很糟糕大部分應該是眼鏡沒有調好，至於要調教好的門檻還是比螢幕裝好還要來得高。
以目前 Quest 2 的解析度還稍嫌不足。但我想未來眼鏡的解析度越來高，跟當年視網膜螢幕一樣突破眼睛的精細度之後，就能達到電腦螢幕一輩子都達不到的境界，不再需要花買一堆高階螢幕，也不用擔心沒地方擺，還要弄一堆螢幕手臂，只要眼鏡戴上要幾個螢幕就有幾個螢幕，螢幕要多大就有多大，而且完全不佔空間，唯一的缺點可能就只剩不能拍水水照分享了。至少以自己來說，對於新螢幕這件事情已經不感興趣了。


